package academy.devonline.java.basic.section2_structure;

import java.util.Scanner;

public class HelloStudyUser {
    public static void main(String[] args) {
        /*
        Создать программу HelloStudyUser, которая считывает имя пользователя с переменной name 
        вместо использования считывания с консоли , а затем выводит на консоль фразу: Hello, ${name}, где ${name} 
        - это то имя, которое задано в переменной name.
         */
  //      var name = dima; //new Scanner(System.in).nextLine();
 //       var name = new Scanner(System.in).nextLine();

        var a = "dima";

        System.out.println("Hello " + a);

    }
}
