package academy.devonline.java.basic.section2_structure;

/*Создать программу OutPractice, которая выводит на консоль все числа от 0 до 9 включительно,
которые нацело делятся на 3, т.е. 0, 3, 6 и 9 сначала в строку, а затем каждое число с новой строчки.
Пример вывода программы:
0369
0
3
6
9
 */

public class OutPractice {
    public static void main(String[] args) {
        System.out.println(0);
        System.out.println(3);
        System.out.println(6);
        System.out.println(9);
//        int number = 9;
//        for (int i = 0; i < 10; i++) ;
//        System.out.println(number);
//    }
//
//    public static int out (int number) {
//                for (int i = 0; i < 10; i++) ;
    }
}
